-- MySQL dump 10.13  Distrib 8.0.44, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: hospital
-- ------------------------------------------------------
-- Server version	8.0.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `patients`
--

DROP TABLE IF EXISTS `patients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patients` (
  `patient_id` int NOT NULL AUTO_INCREMENT,
  `surname` varchar(45) NOT NULL,
  `passport` varchar(45) NOT NULL,
  `address` varchar(45) NOT NULL,
  `birthday` date NOT NULL,
  `ward_id` int DEFAULT NULL,
  `doc_id` int DEFAULT NULL,
  PRIMARY KEY (`patient_id`),
  UNIQUE KEY `pat_id_UNIQUE` (`patient_id`),
  KEY `ward_id_idx` (`ward_id`),
  KEY `doc_id_idx` (`doc_id`),
  CONSTRAINT `doctor_id2` FOREIGN KEY (`doc_id`) REFERENCES `doctors` (`doc_id`),
  CONSTRAINT `ward_id2` FOREIGN KEY (`ward_id`) REFERENCES `wards` (`ward_id`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patients`
--

LOCK TABLES `patients` WRITE;
/*!40000 ALTER TABLE `patients` DISABLE KEYS */;
INSERT INTO `patients` VALUES (1,'Иванов','4601 123456','Москва','1975-03-15',1,1),(2,'Петров','4602 234567','Москва','1980-07-22',1,7),(3,'Сидоров','4603 345678','Москва','1968-11-30',1,17),(4,'Кузнецов','4604 456789','Москва','1992-02-14',2,1),(5,'Смирнов','4605 567890','Москва','1974-08-09',3,7),(6,'Васильев','4606 678901','Москва','1988-05-19',4,2),(7,'Павлов','4607 789012','Москва','1995-12-03',4,19),(8,'Семёнов','4608 890123','Москва','1971-09-25',4,2),(9,'Голубев','4609 901234','Москва','1983-04-17',5,19),(10,'Виноградов','4610 012345','Москва','1969-01-28',6,2),(11,'Фёдоров','4611 123456','Москва','1976-06-11',7,3),(12,'Михайлов','4612 234567','Москва','1980-10-22',7,3),(13,'Белов','4613 345678','Москва','1958-03-05',8,3),(14,'Тарасов','4614 456789','Москва','1990-08-14',9,3),(15,'Богданов','4615 567890','Москва','1982-12-07',10,4),(16,'Комаров','4616 678901','Москва','1979-07-19',10,18),(17,'Орлов','4617 789012','Москва','1967-04-30',11,4),(18,'Киселёв','4618 890123','Москва','1993-11-12',12,18),(19,'Макаров','4619 901234','Москва','1987-02-25',13,5),(20,'Андреев','4620 012345','Москва','1975-09-08',13,5),(21,'Ковалёв','4621 123456','Москва','1963-12-15',14,5),(22,'Ильин','4622 234567','Москва','1989-06-21',15,5),(23,'Гусев','4623 345678','Москва','2018-03-10',16,6),(24,'Титов','4624 456789','Москва','2019-07-22',16,16),(25,'Кузьмин','4625 567890','Москва','2020-11-05',16,6),(26,'Кудрявцев','4626 678901','Москва','2017-04-18',17,16),(27,'Баранов','4627 789012','Москва','2016-09-30',18,6),(28,'Алексеева','4628 890123','Москва','1990-05-15',19,8),(29,'Зайцева','4629 901234','Москва','1985-10-27',19,8),(30,'Ершова','4630 012345','Москва','1993-03-08',20,8),(31,'Тихонова','4631 123456','Москва','1978-12-19',21,8),(32,'Савельев','4632 234567','Москва','1972-08-03',22,9),(33,'Фомин','4633 345678','Москва','1984-01-14',22,9),(34,'Русаков','4634 456789','Москва','1968-06-26',23,9),(35,'Стрелков','4635 567890','Москва','1979-11-09',24,9),(36,'Гущин','4636 678901','Москва','1981-04-21',25,10),(37,'Терентьев','4637 789012','Москва','1976-09-02',25,10),(38,'Колобов','4638 890123','Москва','1991-02-13',26,10),(39,'Субботин','4639 901234','Москва','1965-07-25',27,10),(40,'Фокин','4640 012345','Москва','1989-12-06',28,11),(41,'Дорофеев','4641 123456','Москва','1973-05-18',28,11),(42,'Назаров','4642 234567','Москва','1994-10-29',29,11),(43,'Медведев','4643 345678','Москва','1980-03-11',30,11),(44,'Рожков','4644 456789','Москва','1975-01-04',31,12),(45,'Одинцов','4645 567890','Москва','1986-06-16',31,12),(46,'Блинов','4646 678901','Москва','1992-11-28',32,12),(47,'Антонов','4647 789012','Москва','1970-04-09',33,12),(48,'Чернов','4648 890123','Москва','1983-07-20',34,13),(49,'Романов','4649 901234','Москва','1977-02-01',34,13),(50,'Кобелев','4650 012345','Москва','1995-09-13',35,13),(51,'Ефимов','4651 123456','Москва','1969-12-24',36,13),(52,'Щербаков','4652 234567','Москва','1974-05-07',NULL,14),(53,'Поляков','4653 345678','Москва','1988-10-19',NULL,14),(54,'Цветков','4654 456789','Москва','1962-03-31',NULL,14),(55,'Давыдов','4655 567890','Москва','1979-08-12',NULL,14),(56,'Жуков','4656 678901','Москва','1986-01-23',NULL,15),(57,'Фролов','4657 789012','Москва','1971-06-05',NULL,15),(58,'Никитин','4658 890123','Москва','1990-11-17',NULL,15),(59,'Соболев','4659 901234','Москва','1984-04-28',NULL,15),(66,'Крючков','0000 000000','Норильск','2000-10-10',NULL,1),(82,'Иванков','0001 000001','Москва','2022-02-15',NULL,1);
/*!40000 ALTER TABLE `patients` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-04-06 18:14:49
